Имя <- c("Данна","Илья","Костя","Виталя","Кирилл 1","Кирилл 2","Вадим","Глеб","Лиза","Маша","Андрей")
Матрица <- c(10,10,4,3,6,9,9,8,5,5,8)
Иван_Васильевич_меняет_профессию <- c(4,9,10,6,8,9,7,7,2,3,7)
Гарри_Поттер_и_Кубок_Огня <- c(7,8,10,7,9,10,8,9,8,10,7)
Хроники_Нарнии_Лев_Колдунья_и_Платяной_Шкаф <- c(10,7,6,5,9,7,7,8,10,8,8)
Властелин_Колец_Братство_Кольца <- c(5,10,9,8,10,8,8,6,6,8,9)
Песнь_моря <- c(2,7,5,0,5,5,5,5,10,9,7)
Мулан <- c(10,9,2,2,8,4,3,5,10,10,8)
Эрагон <- c(10,6,7,0,5,5,5,5,9,4,5)
Фантастические_твари_и_где_они_обитают <- c(10,9,8,3,7,9,5,6,10,10,6)
Крестный_отец <- c(4,10,10,5,6,5,9,7,7,3,9)

df = data.frame(Имя, Матрица, Иван_Васильевич_меняет_профессию, Гарри_Поттер_и_Кубок_Огня,Хроники_Нарнии_Лев_Колдунья_и_Платяной_Шкаф,Властелин_Колец_Братство_Кольца,Песнь_моря,Мулан,Эрагон,Фантастические_твари_и_где_они_обитают,Крестный_отец)

a <- apply(df[,2:11],2,max)
b <- apply(df[,2:11],2,min)
c <- apply(df[,2:11],2,mean)

v1 <- apply(df[,2:11],2,function(x) (x > 7))
v2 <- apply(v1,1,function(x) sum(x) > 0)
df[v2,1]
v3 <- sum(v2)

v1 <- apply(df[,2:11],2,function(x) (x < 3))
v2 <- apply(v1,1,function(x) sum(x) > 0)
df[v2,1]
v3 <- sum(v2)


sort(c,decreasing = T)


barplot(c)
hist(c)








